In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity": [50,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        50
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature":[42,40,34],
    "humidity": [80,50,68]
})
us_weather

       city  temperature  humidity
0  new york           42        80
1   chicago           40        50
2   orlando           34        68

In [4]:
df = pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0    mumbai           32        50
1     delhi           45        60
2  banglore           30        78
0  new york           42        80
1   chicago           40        50
2   orlando           34        68

In [5]:
df = pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        50
1     delhi           45        60
2  banglore           30        78
3  new york           42        80
4   chicago           40        50
5   orlando           34        68

In [6]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

             city  temperature  humidity
india 0    mumbai           32        50
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           42        80
      1   chicago           40        50
      2   orlando           34        68

In [7]:
df.loc["us"]

       city  temperature  humidity
0  new york           42        80
1   chicago           40        50
2   orlando           34        68

In [8]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [10]:
windspeed_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature":[7,12,9]
})
windspeed_df

       city  temperature
0    mumbai            7
1     delhi           12
2  banglore            9

In [11]:
df = pd.concat([temperature_df,windspeed_df], axis=1)
df

       city  temperature      city  temperature
0    mumbai           32    mumbai            7
1     delhi           45     delhi           12
2  banglore           30  banglore            9

In [12]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [16]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "temperature":[7,12],
}, index=[1,0])
windspeed_df

     city  temperature
1   delhi            7
0  mumbai           12

In [17]:
df = pd.concat([temperature_df,windspeed_df], axis=1)
df

       city  temperature    city  temperature
0    mumbai           32  mumbai         12.0
1     delhi           45   delhi          7.0
2  banglore           30     NaN          NaN

In [18]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [19]:
s = pd.Series(["humid","dry","rain"],name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [20]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  humid
1     delhi           45    dry
2  banglore           30   rain